// 4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using std::cin;
using std::cout;

/*4. Определить, между какими двумя последующими степенями двойки расположено заданное число. */

int power(int n, int pow) {
    int result=1;
    for (int i = 0; i < pow; i++)
    {
        result *= n;
    }

    return result;
}

int main()
{
    int n;
    int i = 1;

    cout << "Enter n ";
    cin >> n;

    while (n > power(2, i)) {
        i++;
    }

    cout << "Number " << n << " located between " << i - 1 << " and " << i << " powers of two";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
